import type { AriaRole, SVGProps } from 'react';

import React from 'react';

import { getElementClass, getElementId, mergeClassNames } from '@/util/string-helper';

/**
 * @description SVG 아이콘 ('제주도') 을 랜더링합니다.
 * @param props - SVGProps를 상속받은 props 객체.
 * @param {string} [props.className] - css 클래스.
 * @param {string} [props.width='1.5rem'] - 너비. (기본값: '1.5rem')
 * @param {string} [props.height='1.5rem'] - 높이. (기본값: '1.5rem')
 * @remarks 색상이 지정되어 있으므로 fill은 그대로 유지됩니다.
 */
const Jeju = (props: SVGProps<SVGSVGElement>) => {
  const { className, width, height, role, 'aria-label': ariaLabel, ...rest } = props;

  const iconWidth: string | number = width || '1.5rem';
  const iconHeight: string | number = height || '1.5rem';
  const iconClass = getElementClass('Jeju');

  const iconRole: AriaRole = role || 'img';
  const titleId = getElementId('JejuTitle');
  const titleText = ariaLabel || '제주도';

  return (
    <svg
      className={mergeClassNames(iconClass, className)}
      width={iconWidth}
      height={iconHeight}
      xmlns={'http://www.w3.org/2000/svg'}
      preserveAspectRatio={'xMidYMid meet'}
      viewBox={'0 0 24 24'}
      role={iconRole}
      aria-labelledby={titleId}
      {...rest}
    >
      <title id={titleId}>{titleText}</title>
      <path
        fillRule={'evenodd'}
        clipRule={'evenodd'}
        d={
          'M7.67718 9.301C7.67718 6.92401 9.59796 4.99707 11.9674 4.99707C14.3368 4.99707 16.2575 6.92401 16.2575 9.301H17.3301C17.9224 9.301 18.4026 9.78274 18.4026 10.377C18.4026 10.9712 17.9224 11.453 17.3301 11.453H16.7344L17.2276 13.6794C17.4509 14.6876 17.3084 15.6766 16.8991 16.5224C17.4947 16.8559 18.1044 17.3164 18.6223 17.8819C19.35 18.6766 20 19.7985 20 21.1648C20 21.6131 19.9471 22.0679 19.8147 22.5001H4.1853C4.0529 22.0679 4 21.6131 4 21.1648C4 19.7985 4.64999 18.6766 5.3777 17.8819C5.88084 17.3325 6.47068 16.8822 7.05003 16.5512C6.63004 15.6991 6.48169 14.6991 6.70755 13.6794L7.20074 11.453H6.60464C6.01229 11.453 5.5321 10.9712 5.5321 10.377C5.5321 9.78274 6.01229 9.301 6.60464 9.301H7.67718Z'
        }
        fill={'#666666'}
      />
      <path
        d={
          'M11.6265 11.967C11.7574 11.6237 12.2431 11.6237 12.374 11.967L13.1638 14.0382C13.2637 14.3001 13.0703 14.5808 12.7901 14.5808H11.2105C10.9303 14.5808 10.7369 14.3001 10.8367 14.0383L11.6265 11.967Z'
        }
        fill={'#333333'}
      />
      <path
        fillRule={'evenodd'}
        clipRule={'evenodd'}
        d={
          'M8.62944 20.4922C8.37377 20.4922 8.1665 20.7014 8.1665 20.9595C8.1665 21.2176 8.37377 21.4268 8.62944 21.4268C8.84107 21.4268 9.16883 21.4947 9.43037 21.6848C9.63878 21.8362 9.82766 22.0793 9.87133 22.5001H10.8004C10.7508 21.7588 10.4111 21.2459 9.97136 20.9263C9.51862 20.5973 8.98923 20.4922 8.62944 20.4922Z'
        }
        fill={'#333333'}
      />
      <path
        fillRule={'evenodd'}
        clipRule={'evenodd'}
        d={
          'M13.9735 22.5001H15.9964C15.9243 22.3365 15.762 22.2225 15.5732 22.2225C15.3616 22.2225 15.0338 22.1546 14.7723 21.9645C14.5343 21.7916 14.3218 21.4993 14.3218 20.9594C14.3218 20.4195 14.5343 20.1272 14.7723 19.9543C15.0338 19.7642 15.3616 19.6962 15.5732 19.6962C15.8289 19.6962 16.0361 19.487 16.0361 19.229C16.0361 18.9709 15.8289 18.7617 15.5732 18.7617C15.2134 18.7617 14.684 18.8668 14.2313 19.1958C13.7549 19.542 13.396 20.1149 13.396 20.9594C13.396 21.643 13.6312 22.1486 13.9735 22.5001Z'
        }
        fill={'#333333'}
      />
      <path
        fillRule={'evenodd'}
        clipRule={'evenodd'}
        d={
          'M19.0891 3.95765C19.0902 3.95354 19.0913 3.94941 19.0924 3.94528C19.3301 3.0268 18.7852 2.08772 17.8753 1.84777C16.9654 1.60782 16.035 2.15787 15.7973 3.07635C15.7962 3.08049 15.7952 3.08462 15.7941 3.08876C14.7571 3.41106 13.9043 4.25161 13.6099 5.38917C13.1576 7.1368 14.1945 8.92364 15.9258 9.3802C17.6571 9.83676 19.4273 8.79015 19.8796 7.04252C20.174 5.90495 19.8375 4.75075 19.0891 3.95765Z'
        }
        fill={'#FFA215'}
      />
      <path
        d={'M19.8489 1.06543L19.6302 1.54448C19.2257 2.43083 18.2412 2.89297 17.2999 2.63839L17.1974 2.61066L17.2296 2.48941C17.4793 1.54896 18.3687 0.927805 19.3367 1.01781L19.8489 1.06543Z'}
        fill={'#70BB11'}
      />
    </svg>
  );
};

export default Jeju;
