import type { AriaRole, SVGProps } from 'react';

import React from 'react';

import style from './style.module.scss';

import { getElementClass, getElementId, mergeClassNames } from '@/util/string-helper';

type StateType = 'default' | 'active';

type Props = SVGProps<SVGSVGElement> & {
  state?: StateType;
};

/**
 * @description SVG 아이콘 ('회사') 을 랜더링합니다.
 * @param props - SVGProps를 상속받은 props 객체.
 * @param {string} [props.className] - css 클래스.
 * @param {string} [props.width='1.5rem'] - 너비. (기본값: '1.5rem')
 * @param {string} [props.height='1.5rem'] - 높이. (기본값: '1.5rem')
 * @remarks 웹 접근성을 위해 `role`, `aria-label` 등의 a11y 관련 props 설정을 권장합니다.
 */
const FavOffice = (props: Props) => {
  const { className, state = 'default', width, height, role, 'aria-label': ariaLabel, ...rest } = props;

  const isActive = state === 'active';

  const iconWidth: string | number = width || '1.5rem';
  const iconHeight: string | number = height || '1.5rem';
  const iconClass = getElementClass('FavOffice');
  const iconStateClass = isActive ? style['layout--active'] : style['layout-default'];

  /* a11y 기본설정 */
  const iconRole: AriaRole = role || 'img';
  const titleId = getElementId('FavOfficeTitle');
  const titleText = ariaLabel || '회사';

  return (
    <svg
      className={mergeClassNames(iconClass, iconStateClass, className)}
      width={iconWidth}
      height={iconHeight}
      xmlns={'http://www.w3.org/2000/svg'}
      preserveAspectRatio={'xMidYMid meet'}
      viewBox={'0 0 24 24'}
      role={iconRole}
      aria-labelledby={titleId}
      {...rest}
    >
      <title id={titleId}>{titleText}</title>
      {isActive && (
        <path
          d={
            'M17.625 2.25C18.6605 2.25 19.5 3.08121 19.5 4.10645V20.25H20.0996C20.5967 20.25 21 20.5858 21 21C21 21.4142 20.5967 21.75 20.0996 21.75H3.90039C3.40333 21.75 3 21.4142 3 21C3 20.5858 3.40333 20.25 3.90039 20.25H4.5V4.10645C4.5 3.08121 5.33947 2.25 6.375 2.25H17.625ZM10.875 14.25C10.2537 14.25 9.75 14.6977 9.75 15.25V20.25H14.25V15.25C14.25 14.6977 13.7463 14.25 13.125 14.25H10.875ZM9.15234 10.7578C8.65404 10.7578 8.25 11.1619 8.25 11.6602C8.25005 12.1584 8.65407 12.5625 9.15234 12.5625H10.0781C10.5762 12.5622 10.9794 12.1583 10.9795 11.6602C10.9795 11.162 10.5762 10.7581 10.0781 10.7578H9.15234ZM13.9229 10.7578C13.4246 10.7578 13.0205 11.1619 13.0205 11.6602C13.0206 12.1584 13.4246 12.5625 13.9229 12.5625H14.8477C15.3459 12.5625 15.75 12.1584 15.75 11.6602C15.75 11.1619 15.346 10.7578 14.8477 10.7578H13.9229ZM9.15234 6.75C8.65415 6.75013 8.25 7.15412 8.25 7.65234C8.25005 8.15053 8.65418 8.55456 9.15234 8.55469H10.0781C10.5763 8.5546 10.9804 8.15055 10.9805 7.65234C10.9805 7.15409 10.5764 6.75009 10.0781 6.75H9.15234ZM13.9229 6.75C13.4246 6.75008 13.0205 7.15409 13.0205 7.65234C13.0206 8.15056 13.4246 8.55461 13.9229 8.55469H14.8486C15.3468 8.55456 15.7509 8.15052 15.751 7.65234C15.751 7.15412 15.3468 6.75013 14.8486 6.75H13.9229Z'
          }
          fill={'currentColor'}
        />
      )}
      {!isActive && (
        <path
          d={
            'M17.625 2.25C18.6605 2.25 19.5 3.08121 19.5 4.10645V20.249H20.25C20.6641 20.249 20.9999 20.5849 21 20.999C21 21.4132 20.6642 21.749 20.25 21.749H3.75C3.33579 21.749 3 21.4132 3 20.999C3.00013 20.5849 3.33587 20.249 3.75 20.249H4.5V4.10645C4.5 3.08121 5.33947 2.25 6.375 2.25H17.625ZM6.375 3.75C6.15372 3.75 6 3.92374 6 4.10645V20.249H9V15.6592C9 14.6185 9.87937 13.8447 10.875 13.8447H13.125C14.1206 13.8447 15 14.6185 15 15.6592V20.249H18V4.10645C18 3.92374 17.8463 3.75 17.625 3.75H6.375ZM10.875 15.3447C10.628 15.3447 10.5 15.5245 10.5 15.6592V20.2295H13.5V15.6592C13.5 15.5245 13.372 15.3447 13.125 15.3447H10.875ZM10.0771 10.7578C10.5753 10.7579 10.9795 11.1619 10.9795 11.6602C10.9794 12.1583 10.5753 12.5624 10.0771 12.5625H9.15137C8.65317 12.5624 8.24907 12.1584 8.24902 11.6602C8.24902 11.1619 8.65314 10.7579 9.15137 10.7578H10.0771ZM14.8477 10.7578C15.3457 10.7581 15.749 11.162 15.749 11.6602C15.749 12.1583 15.3457 12.5622 14.8477 12.5625H13.9219C13.4236 12.5625 13.0196 12.1584 13.0195 11.6602C13.0195 11.1619 13.4236 10.7578 13.9219 10.7578H14.8477ZM10.0771 6.75C10.5754 6.75 10.9795 7.15404 10.9795 7.65234C10.9794 8.15061 10.5754 8.55469 10.0771 8.55469H9.15137C8.65331 8.55443 8.25005 8.15045 8.25 7.65234C8.25 7.1542 8.65328 6.75026 9.15137 6.75H10.0771ZM14.8477 6.75C15.346 6.75 15.75 7.15404 15.75 7.65234C15.75 8.15061 15.3459 8.55469 14.8477 8.55469H13.9219C13.4238 8.55447 13.0196 8.15047 13.0195 7.65234C13.0195 7.15417 13.4238 6.75021 13.9219 6.75H14.8477Z'
          }
          fill={'currentColor'}
        />
      )}
    </svg>
  );
};

export default FavOffice;
