import type { AriaRole, SVGProps } from 'react';

import React from 'react';

import { getElementClass, mergeClassNames } from '@/util/string-helper';

/**
 * @description SVG 아이콘 ('호텔 서비스') 을 랜더링합니다.
 * @param props - SVGProps를 상속받은 props 객체.
 * @param {string} [props.className] - css 클래스.
 * @param {string} [props.width='1.5rem'] - 너비. (기본값: '1.5rem')
 * @param {string} [props.height='1.5rem'] - 높이. (기본값: '1.5rem')
 * @remarks 웹 접근성을 위해 `role`, `aria-label` 등의 a11y 관련 props 설정을 권장합니다.
 */
const HotelService = (props: SVGProps<SVGSVGElement>) => {
  const { className, width, height, role, 'aria-label': ariaLabel, ...rest } = props;

  const iconWidth: string | number = width || '1.5rem';
  const iconHeight: string | number = height || '1.5rem';
  const iconClass = getElementClass('HotelService');

  /* a11y 기본설정 */
  const iconRole: AriaRole = role || 'img';
  const titleText = ariaLabel || '호텔 서비스';

  return (
    <svg
      className={mergeClassNames(iconClass, className)}
      width={iconWidth}
      height={iconHeight}
      xmlns={'http://www.w3.org/2000/svg'}
      preserveAspectRatio={'xMidYMid meet'}
      viewBox={'0 0 24 24'}
      role={iconRole}
      {...rest}
    >
      <title>{titleText}</title>
      <path
        fillRule={'evenodd'}
        clipRule={'evenodd'}
        d={
          'M3.99878 15.8426C3.99878 15.4075 4.35084 15.0547 4.78513 15.0547H21.7136C22.1479 15.0547 22.4999 15.4075 22.4999 15.8426V17.2331C22.4999 18.3308 21.7047 19.4115 20.5044 19.4115H5.9943C4.794 19.4115 3.99878 18.3308 3.99878 17.2331V15.8426ZM5.57147 16.6305V17.2331C5.57147 17.6712 5.85895 17.8356 5.9943 17.8356H20.5044C20.6398 17.8356 20.9272 17.6712 20.9272 17.2331V16.6305H5.57147Z'
        }
        fill={'currentColor'}
      />
      <path
        fillRule={'evenodd'}
        clipRule={'evenodd'}
        d={
          'M1.5 2.28793C1.5 1.85277 1.85206 1.5 2.28635 1.5H3.57613C4.62114 1.5 5.57166 2.30056 5.57166 3.41121V15.8422C5.57166 16.2773 5.2196 16.6301 4.78531 16.6301C4.35102 16.6301 3.99896 16.2773 3.99896 15.8422V3.41121C3.99896 3.28108 3.86678 3.07585 3.57613 3.07585H2.28635C1.85206 3.07585 1.5 2.72309 1.5 2.28793Z'
        }
        fill={'currentColor'}
      />
      <path
        fillRule={'evenodd'}
        clipRule={'evenodd'}
        d={
          'M19.1709 19.7609C18.8063 19.7609 18.5502 20.0427 18.5502 20.3423C18.5502 20.6419 18.8063 20.9237 19.1709 20.9237C19.5355 20.9237 19.7916 20.6419 19.7916 20.3423C19.7916 20.0427 19.5355 19.7609 19.1709 19.7609ZM16.9775 20.3423C16.9775 19.1294 17.9813 18.1851 19.1709 18.1851C20.3605 18.1851 21.3643 19.1294 21.3643 20.3423C21.3643 21.5552 20.3605 22.4996 19.1709 22.4996C17.9813 22.4996 16.9775 21.5552 16.9775 20.3423Z'
        }
        fill={'currentColor'}
      />
      <path
        fillRule={'evenodd'}
        clipRule={'evenodd'}
        d={
          'M7.80472 19.7609C7.44014 19.7609 7.18402 20.0427 7.18402 20.3423C7.18402 20.6419 7.44014 20.9237 7.80472 20.9237C8.1693 20.9237 8.42541 20.6419 8.42541 20.3423C8.42541 20.0427 8.1693 19.7609 7.80472 19.7609ZM5.61133 20.3423C5.61133 19.1294 6.61512 18.1851 7.80472 18.1851C8.99431 18.1851 9.9981 19.1294 9.9981 20.3423C9.9981 21.5552 8.99431 22.4996 7.80472 22.4996C6.61512 22.4996 5.61133 21.5552 5.61133 20.3423Z'
        }
        fill={'currentColor'}
      />
      <path
        fillRule={'evenodd'}
        clipRule={'evenodd'}
        d={
          'M7.91452 12.4102C8.34881 12.4102 8.70087 12.0574 8.70087 11.6222V6.01318H18.5604V11.6222C18.5604 12.0574 18.9124 12.4102 19.3467 12.4102C19.781 12.4102 20.1331 12.0574 20.1331 11.6222V5.22525C20.1331 4.79009 19.781 4.43733 19.3467 4.43733H7.91452C7.48023 4.43733 7.12817 4.79009 7.12817 5.22525V11.6222C7.12817 12.0574 7.48023 12.4102 7.91452 12.4102Z'
        }
        fill={'currentColor'}
      />
      <path
        fillRule={'evenodd'}
        clipRule={'evenodd'}
        d={
          'M10.5527 12.624C10.987 12.624 11.3391 12.2713 11.3391 11.8361V5.34729C11.3391 4.91213 10.987 4.55936 10.5527 4.55936C10.1184 4.55936 9.76636 4.91213 9.76636 5.34729V11.8361C9.76636 12.2713 10.1184 12.624 10.5527 12.624Z'
        }
        fill={'currentColor'}
      />
      <path
        fillRule={'evenodd'}
        clipRule={'evenodd'}
        d={
          'M16.7087 12.624C17.143 12.624 17.4951 12.2713 17.4951 11.8361V5.34729C17.4951 4.91213 17.143 4.55936 16.7087 4.55936C16.2744 4.55936 15.9224 4.91213 15.9224 5.34729V11.8361C15.9224 12.2713 16.2744 12.624 16.7087 12.624Z'
        }
        fill={'currentColor'}
      />
      <path
        fillRule={'evenodd'}
        clipRule={'evenodd'}
        d={
          'M12.2613 3.35417C12.1846 3.35417 12.1225 3.41643 12.1225 3.49322V4.42019C12.1225 4.85535 11.7704 5.20812 11.3362 5.20812C10.9019 5.20812 10.5498 4.85535 10.5498 4.42019V3.49322C10.5498 2.54611 11.3161 1.77832 12.2613 1.77832H15.1012C16.0464 1.77832 16.8126 2.54611 16.8126 3.49322V4.42019C16.8126 4.85535 16.4606 5.20812 16.0263 5.20812C15.592 5.20812 15.2399 4.85535 15.2399 4.42019V3.49322C15.2399 3.41643 15.1778 3.35417 15.1012 3.35417H12.2613Z'
        }
        fill={'currentColor'}
      />
      <path
        fillRule={'evenodd'}
        clipRule={'evenodd'}
        d={
          'M4.7832 12.3294C4.7832 11.8943 5.13526 11.5415 5.56955 11.5415H19.6529C20.5981 11.5415 21.3643 12.3093 21.3643 13.2564V15.0681C21.3643 15.5033 21.0123 15.856 20.578 15.856C20.1437 15.856 19.7916 15.5033 19.7916 15.0681V13.2564C19.7916 13.1796 19.7295 13.1174 19.6529 13.1174H5.56955C5.13526 13.1174 4.7832 12.7646 4.7832 12.3294Z'
        }
        fill={'currentColor'}
      />
    </svg>
  );
};

export default HotelService;
